app/views/qualificacoes/_form.html.erb

    <%= f.label :cliente_id %><br>
    <%= f.collection_select(:cliente_id, Cliente.order(:nome), :id, :nome, :prompt => true) %>
---
SELECT `clientes`.* FROM `clientes`  ORDER BY `clientes`.`nome` ASC

    <%= f.label :restaurante_id %><br>
    <%= f.collection_select(:restaurante_id,Restaurante.order(:nome), :id, :nome, :prompt => true) %>
---
SELECT `restaurantes`.* FROM `restaurantes`  ORDER BY `restaurantes`.`nome` ASC