app/views/qualificacoes/_novo_qualificacao.html.erb

	<%= f.hidden_field :restaurante_id, value: restaurante.id %>
	<%= f.label :cliente %> <%= f.select :cliente_id, Cliente.all.collect {|i| [i.nome,i.id]}, {}, class: "form-control" %> <br>
---
SELECT `clientes`.* FROM `clientes`