app/controllers/comentarios_controller.rb

SELECT `comentarios`.* FROM `comentarios`
---
  def index
    @comentarios = Comentario.all

INSERT INTO `comentarios` (`comentario`, `comentavel_type`, `comentavel_id`, `created_at`, `updated_at`) VALUES ('Bomba', 'Restaurante', 7, '2016-07-12 23:27:03.269129', '2016-07-12 23:27:03.269129')
---
  def create
    @comentario = Comentario.new(comentario_params)

    respond_to do |format|
      if @comentario.save

DELETE FROM `comentarios` WHERE `comentarios`.`id` = 10
---
  def destroy
    @comentario.destroy

SELECT  `comentarios`.* FROM `comentarios` WHERE `comentarios`.`id` = 10 LIMIT 1
---
    def set_comentario
      @comentario = Comentario.find(params[:id])