app/controllers/restaurantes_controller.rb

	def index
		@restaurantes = Restaurante.order :nome
---
SELECT `restaurantes`.* FROM `restaurantes`  ORDER BY `restaurantes`.`nome` ASC

	def show
		@restaurante = Restaurante.find(params[:id])
---
SELECT  `restaurantes`.* FROM `restaurantes` WHERE `restaurantes`.`id` = 1 LIMIT 1

	def destroy
		@restaurante = Restaurante.find(params[:id])
		@restaurante.destroy
---
SELECT  `restaurantes`.* FROM `restaurantes` WHERE `restaurantes`.`id` = 1 LIMIT 1
DELETE FROM `restaurantes` WHERE `restaurantes`.`id` = 1

	def create
		@restaurante = Restaurante.new restaurante_params
		if @restaurante.save
---
INSERT INTO `restaurantes` (`nome`, `especialidade`, `created_at`, `updated_at`) VALUES ('Emporio', 'Italiano', '2016-07-07 22:18:13.506726', '2016-07-07 22:18:13.506726')

	def edit
		@restaurante = Restaurante.find(params[:id])
---
SELECT  `restaurantes`.* FROM `restaurantes` WHERE `restaurantes`.`id` = 6 LIMIT 1

	def update
		@restaurante = Restaurante.find(params[:id])
		@restaurante.update_attributes restaurante_params
---
SELECT  `restaurantes`.* FROM `restaurantes` WHERE `restaurantes`.`id` = 6 LIMIT 1
UPDATE `restaurantes` SET `especialidade` = 'lafasfds', `updated_at` = '2016-07-07 22:37:55.288256' WHERE `restaurantes`.`id` = 6